# Curso de python do Zero ao DS

In [1]:
#importando bibliotecas
import pandas as pd

In [2]:
df = pd.read_csv(r'kc_house_data.csv')

In [3]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180.0,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170.0,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770.0,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050.0,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680.0,0,1987,0,98074,47.6168,-122.045,1800,7503

In [4]:
print(df.shape)

(21613, 21)

In [5]:
print(df.columns)

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [6]:
print(df[['id', 'price']].sort_values('price', ascending=False))

               id      price
7252   6762700020  7700000.0
3914   9808700762  7062500.0
9254   9208900037  6885000.0
4411   2470100110  5570000.0
1448   8907500070  5350000.0
...           ...        ...
8274   3883800011    82000.0
16198  3028200080    81000.0
465    8658300340    80000.0
15293    40000362    78000.0
1149   3421079032    75000.0

[21613 rows x 2 columns]

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21611 non-null  float64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(6), int64(14), object(1)
memory usage: 3.5+ MB

In [8]:
df['date'] = pd.to_datetime(df['date'], format='%Y%m%dT')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  datetime64[ns]
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21611 non-null  float64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: datetime64[ns](1), float64(6), int64(14)
memory usage: 3.5 MB

In [10]:
df['date']

0       2014-10-13
1       2014-12-09
2       2015-02-25
3       2014-12-09
4       2015-02-18
           ...
21608   2014-05-21
21609   2015-02-23
21610   2014-06-23
21611   2015-01-16
21612   2014-10-15
Name: date, Length: 21613, dtype: datetime64[ns]

In [11]:
# data do imovel mais antigo
df.sort_values('date', ascending=True)['date'].min()

Timestamp('2014-05-02 00:00:00')

In [12]:
# quantos imoveis tem o numero maximo de andares
print(f"Quantidade de imóveis com o número máximo de andares: \
{len(df[df['floors'] == df['floors'].max()])} imóveis")

Quantidade de imóveis com o número máximo de andares: 8 imóveis

In [13]:
df.iloc[0:10, 0:3]

           id       date      price
0  7129300520 2014-10-13   221900.0
1  6414100192 2014-12-09   538000.0
2  5631500400 2015-02-25   180000.0
3  2487200875 2014-12-09   604000.0
4  1954400510 2015-02-18   510000.0
5  7237550310 2014-05-12  1225000.0
6  1321400060 2014-06-27   257500.0
7  2008000270 2015-01-15   291850.0
8  2414600126 2015-04-15   229500.0
9  3793500160 2015-03-12   323000.0

In [14]:
# selecao de linhas e colunas atraves do index
df.iloc[0:10, :]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,2014-10-13,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180.0,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,2014-12-09,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170.0,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,2015-02-25,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770.0,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,2014-12-09,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050.0,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,2015-02-18,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680.0,0,1987,0,98074,47.6168,-122.045,1800,7503
5,7237550310,2014-05-12,1225000.0,4,4.50,5420,101930,1.0,0,0,...,11,3890.0,1530,2001,0,98053,47.6561,-122.005,4760,101930
6,1321400060,2014-06-27,257500.0,3,2.25,1715,6819,2.0,0,0,...,7,1715.0,0,1995,0,98003,47.3097,-122.327,2238,6819
7,2008000270,2015-01-15,291850.0,3,1.50,1060,9711,1.0,0,0,...,7,1060.0,0,1963,0,98198,47.4095,-122.315,1650,9711
8,2414600126,2015-04-15,229500.0,3,1.00,1780,7470,1.0,0,0,...,7,1050.0,730,1960,0,98146,47.5123,-122.337,1780,8113
9,3793500160,2015-03-12,323000.0,3,2.50,1890,6560,2.0,0,0,...,7,1890.0,0,2003,0,98038,47.3684,-122.031,2390,7570

In [15]:
# selecao das linhas e nome da coluna
df.loc[0:10, ['price', 'id', 'date']]

        price          id       date
0    221900.0  7129300520 2014-10-13
1    538000.0  6414100192 2014-12-09
2    180000.0  5631500400 2015-02-25
3    604000.0  2487200875 2014-12-09
4    510000.0  1954400510 2015-02-18
5   1225000.0  7237550310 2014-05-12
6    257500.0  1321400060 2014-06-27
7    291850.0  2008000270 2015-01-15
8    229500.0  2414600126 2015-04-15
9    323000.0  3793500160 2015-03-12
10   662500.0  1736800520 2015-04-03

In [16]:
# selecao atraves de indices boleanos 1 ou 0 / True ou False
""" id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15' """
cols = [True, True, True, True, False, False, False, False, False, False, False, \
        False, False, False, False, False, False, False, False, False, False]

In [17]:
df.loc[0:10, cols]

            id       date      price  bedrooms
0   7129300520 2014-10-13   221900.0         3
1   6414100192 2014-12-09   538000.0         3
2   5631500400 2015-02-25   180000.0         2
3   2487200875 2014-12-09   604000.0         4
4   1954400510 2015-02-18   510000.0         3
5   7237550310 2014-05-12  1225000.0         4
6   1321400060 2014-06-27   257500.0         3
7   2008000270 2015-01-15   291850.0         3
8   2414600126 2015-04-15   229500.0         3
9   3793500160 2015-03-12   323000.0         3
10  1736800520 2015-04-03   662500.0         3

In [18]:
# classicacao do nivel 
df['level'] = 'standard'
df.loc[df['price'] > 540e3, 'level'] = 'high_level'
df.loc[df['price'] < 540e3, 'level'] = 'low_level'
df['level']

0         low_level
1         low_level
2         low_level
3        high_level
4         low_level
            ...
21608     low_level
21609     low_level
21610     low_level
21611     low_level
21612     low_level
Name: level, Length: 21613, dtype: object

In [19]:
# relatorio ordenado pelo preco
report = df[['id', 'date', 'price', 'bedrooms', 'sqft_lot', 'level']].sort_values('price', ascending=False)

In [20]:
# salvando relatorio em um arquivo csv
report.to_csv('report_aula2.csv', index=False)

## Desenhando um mapa

In [21]:
#importando bibliotecas
import plotly.express as px

ModuleNotFoundError: No module named 'plotly'

In [ ]:
data_mapa = df[['id', 'lat', 'long', 'price']]

In [ ]:
data_mapa.head()

In [ ]:
# for index, colecao in df.iterrows():
#     marcador.add_child(folium.Marker([colecao['lat'], colecao['long']],
#                               popup=str(colecao['id']),
#                               tooltip=colecao['level'],
#                               icon=folium.Icon(color='green', icon='info-sign'))).add_to(mapa)

In [ ]:
# for i in range(0,len(df)):
#    folium.Circle(
#       location=[df.iloc[i]['lat'], df.iloc[i]['long']],
#       popup=df.iloc[i]['id'],
#       radius=float(df.iloc[i]['price']),
#       color='crimson',
#       fill=True,
#       fill_color='crimson'
#    ).add_to(mapa)

In [ ]:
mapa = px.scatter_mapbox(data_mapa, lat='lat', lon='long', 
    hover_name='id',
    hover_data=['price'],
    zoom=10, height=300)
mapa.update_layout(mapbox_style='open-street-map')
mapa.update_layout(height=800, margin={'r':0, 'l':0, 't':0, 'b':0})

In [ ]:
mapa.write_html('mapa_house.html')

### Perguntas aula 1
1. Quantas casas estão disponíveis para compra?
2. Quantos atributos as casas possuem?
3. Quais são os atributos das casas?
4. Qual a casa mais cara ( casa com o maior valor de venda )?
5. Qual a casa com o maior número de quartos?
6. Qual a soma total de quartos do conjunto de dados?
7. Quantas casas possuem 2 banheiros?
8. Qual o preço médio de todas as casas no conjunto de dados?
9. Qual o preço médio de casas com 2 banheiros?
10. Qual o preço mínimo entre as casas com 3 quartos?
11. Quantas casas possuem mais de 300 metros quadrados na sala de estar?
12. Quantas casas tem mais de 2 andares?
13. Quantas casas tem vista para o mar?
14. Das casas com vista para o mar, quantas tem 3 quartos?
15. Das casas com mais de 300 metros quadrados de sala de estar, quantas tem mais de 2 banheiros?

In [22]:
# Quantas casas estão disponíveis para compra?
# Quantos atributos as casas possuem?
print(f'Temos {df.shape[0]} casas disponíveis e as casas possuem {df.shape[1]} atributos')

Temos 21613 casas disponíveis e as casas possuem 22 atributos

In [24]:
# Quais são os atributos das casas?
for atributo in df.columns:
    print(atributo)

id
date
price
bedrooms
bathrooms
sqft_living
sqft_lot
floors
waterfront
view
condition
grade
sqft_above
sqft_basement
yr_built
yr_renovated
zipcode
lat
long
sqft_living15
sqft_lot15
level

In [28]:
# Qual a casa mais cara ( casa com o maior valor de venda )?
df.loc[df['price'] == df['price'].max()]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,level
7252,6762700020,2014-10-13,7700000.0,6,8.0,12050,27600,2.5,0,3,...,8570.0,3480,1910,1987,98102,47.6298,-122.323,3940,8800,high_level

In [29]:
# Qual a casa com o maior número de quartos?
df.loc[df['bedrooms'] == df['bedrooms'].max()]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,level
15870,2402100895,2014-06-25,640000.0,33,1.75,1620,6000,1.0,0,0,...,1040.0,580,1947,0,98103,47.6878,-122.331,1330,4700,high_level

In [32]:
#Qual a soma total de quartos do conjunto de dados?
print(f"Temos um total de {df['bedrooms'].sum()} quartos disponíveis")

Temos um total de 72854 quartos disponíveis

In [38]:
# Quantas casas possuem 2 banheiros?
print(f"O total de casas com 2 banheiros é {df.loc[df['bathrooms'] == 2].count()[0]} casas")

O total de casas com 2 banheiros é 1930 casas

In [46]:
# Qual o preço médio de todas as casas no conjunto de dados?
print(f"O valor do preço médio das casas é de R${df['price'].mean():,.2f}")

O valor do preço médio das casas é de R$540,088.14

In [47]:
# Qual o preço médio de casas com 2 banheiros?
print(f"Preço médio das casas com 2 banheiros R${df.loc[df['bathrooms'] == 2, 'price'].mean():,.2f}")

Preço médio das casas com 2 banheiros R$457,889.72

In [49]:
# Qual o preço mínimo entre as casas com 3 quartos?
print(f"O menor valor das casas com 3 quartos é de R${df.loc[df['bedrooms'] == 3, 'price'].min():,.2f}")

O menor valor das casas com 3 quartos é de R$82,000.00

In [54]:
# Quantas casas possuem mais de 300 metros quadrados na sala de estar?
print(f"{df.loc[df['sqft_living'] > (300*10.764)].count()[0]} casas tem mais de 300 m2")

2258 casas tem mais de 300 m2

In [57]:
# Quantas casas tem mais de 2 andares?
print(f"{df.loc[df['floors'] >= 2].count()[0]} casas tem mais de 2 andares")

9023 casas tem mais de 2 andares

In [70]:
# Quantas casas tem vista para o mar?
print(f"{df.loc[df['waterfront'] == 1].count()[0]} casas tem vista para o mar")

163 casas tem vista para o mar

In [72]:
# Das casas com vista para o mar, quantas tem 3 quartos?
print(f"{df.loc[(df['waterfront'] == 1) & (df['bedrooms'] == 3)].count()[0]} casas com 3 quartos tem vista para o mar")

64 casas com 3 quartos tem vista para o mar

In [75]:
# Das casas com mais de 300 metros quadrados de sala de estar, quantas tem mais de 2 banheiros?
print(f"{df.loc[(df['sqft_living'] > (300*10.764)) & (df['bathrooms'] >= 2)].count()[0]} casas tem mais de 300 m2 tem mais de 2 banheiros")

2219 casas tem mais de 300 m2 tem mais de 2 banheiros